[
  {
    "name": "CV",
    "children": [
      {
        "name": "TWO-N",
        "children": [
          {
            "name": "Data Visualization Engineer",
            "children": [
              {
                "name": "tasks",
                "value": "Designed and built interactive data visualizations using D3 and JavaScript, enhancing user experience by creating intuitive, visually engaging dashboards for client decision-making, in diverse industries."
              },
              {
                "name": "tasks",
                "value": "Collaborated closely with clients to tailor UX/UI elements to their branding and functionality requirements, ensuring each visualization met unique user needs."
              }
            ]
          }
        ]
      },
      {
        "name": "Dow Jones/The Wall Street Journal | Hogarth WW",
        "children": [
          {
            "name": "Front-End Developer, Tech Lead",
            "children": [
              {
                "name": "tasks",
                "value": "Led the development of digital marketing assets using HTML5, CSS, JavaScript, and JSON to enhance user interaction and engagement across client sites."
              },
              {
                "name": "tasks",
                "value": "Managed code repositories and documentation with Git, establishing a streamlined Git flow process for efficient collaboration and version control."
              },
              {
                "name": "tasks",
                "value": "Collaborated with design teams to create and edit designs, images, and interactive GIFs, utilizing Adobe Suite and Photoshop, and aligning assets with branding and increasing content engagement."
              }
            ]
          }
        ]
      },
      {
        "name": "Qapital, Inc",
        "children": [
          {
            "name": "Front-End Developer, Tech Support",
            "children": [
              {
                "name": "tasks",
                "value": "Developed internal CMS features using JavaScript, Angular, HTML5, and CSS, optimizing content management for internal teams."
              },
              {
                "name": "tasks",
                "value": "Investigated and resolved front-end discrepancies, ensuring a seamless and bug-free user experience across client accounts."
              }
            ]
          }
        ]
      },
      {
        "name": "Signal360 (formerly Sonic Notify)",
        "children": [
          {
            "name": "Business Development Manager",
            "children": [
              {
                "name": "tasks",
                "value": "Supported product development and sales engineering efforts by providing technical insights on front-end implementation strategies."
              },
              {
                "name": "tasks",
                "value": "Contributed to UI/UX considerations during strategic planning sessions to improve user engagement and interaction within the product suite."
              }
            ]
          }
        ]
      }
    ]
  }
]